taskt/Core/Automation/Commands/ExcelGroup/IExcelWorksheetCopyRenameProperties.dot
digraph "taskt.Core.Automation.Commands.IExcelWorksheetCopyRenameProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IExcelWorksheetCopyRenameProperties" [ label="IExcelWorksheetCopyRenameProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelWorksheetActionProperties" [ label="IExcelWorksheetActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExcelInstanceProperties" [ label="IExcelInstanceProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IExpandableProperties" [ label="IExpandableProperties", shape="ellipse", style="dashed", ];

"taskt.Core.Automation.Commands.IExcelWorksheetCopyRenameProperties" -> "taskt.Core.Automation.Commands.IExcelWorksheetActionProperties";
"taskt.Core.Automation.Commands.IExcelWorksheetActionProperties" -> "taskt.Core.Automation.Commands.IExcelInstanceProperties";
"taskt.Core.Automation.Commands.IExcelInstanceProperties" -> "taskt.Core.Automation.Commands.IExpandableProperties";
}
